org/2021/in-society-people-must-abide-by-the-main-social-agreements.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 人在社会中，必须遵守社会主要约定

如题

脑中的这句话回荡很久，旧有的关于这方面的思考也浮现在眼前。

人的生活离不开他人，由此判断人是群居动物。

一个系统由三个部分组成：输入-->处理-->输出。人类系统（也即社会）也是如此。输入即出生，输出即死亡，处理即个体生命历程。就社会而言，处理过程尤为复杂，个体繁多，不尽相同。但是，纵观漫长的人类历史，总有一些约定俗成的事情，指导着人们的生活。后辈在这些约定里，选择性接受，并加以改造，以使自己更好地适应社会。

但是，一些人会质疑这些经过广泛传播的约定，即便经过合时宜的改造，仍心存疑虑。他们觉得这样接受前人的观点仍容易被人牵着鼻子走，还要用自己的脑子，经过推敲才行。合适的约定接受，不合适的拒绝。这样做，在我看来是可取的。身为人类中的个体，能够思考是幸福的，保有思考的成果则是必要的。我愿意观察前人乃至今人的观点，只为不走进死胡同。但这不代表，我要全盘接受。

但是，有些约定就像金科玉律一样，影响着我。比如：

一、结婚

我能不结婚吗？能。我会这样做（不结婚）吗？不会。我想这样做（不结婚）吗？不想。

二、生子

我能不生子吗？能。我会这样做（不生子）吗？不会。我想这样做（不生子）吗？不想。

为什么这样回答？

原因有很多层面。有个人层面，有社会约定层面。现在只谈后者：

社会长久以来的约定------结婚生子是必然发生的。社会要求我们这样做，为什么？因为社会要延续下去，不生子怎么能行？只要是两个人类就能生子吗？不是。两个人在生子前要缔结社会关系------婚姻。这种关系被社会承认，由法律约束。法律是社会约定的一层保障。
