blog/2021/in-society-people-must-abide-by-the-main-social-agreements.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-03 Thu 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>人在社会中，必须遵守社会主要约定</title>
<meta name="generator" content="Org mode">
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">人在社会中，必须遵守社会主要约定</h1>
</header><p>
如题
</p>

<p>
脑中的这句话回荡很久，旧有的关于这方面的思考也浮现在眼前。
</p>

<p>
人的生活离不开他人，由此判断人是群居动物。
</p>

<p>
一个系统由三个部分组成：输入&#x2013;&gt;处理&#x2013;&gt;输出。人类系统（也即社会）也是如此。输入即出生，输出即死亡，处理即个体生命历程。就社会而言，处理过程尤为复杂，个体繁多，不尽相同。但是，纵观漫长的人类历史，总有一些约定俗成的事情，指导着人们的生活。后辈在这些约定里，选择性接受，并加以改造，以使自己更好地适应社会。
</p>

<p>
但是，一些人会质疑这些经过广泛传播的约定，即便经过合时宜的改造，仍心存疑虑。他们觉得这样接受前人的观点仍容易被人牵着鼻子走，还要用自己的脑子，经过推敲才行。合适的约定接受，不合适的拒绝。这样做，在我看来是可取的。身为人类中的个体，能够思考是幸福的，保有思考的成果则是必要的。我愿意观察前人乃至今人的观点，只为不走进死胡同。但这不代表，我要全盘接受。
</p>

<p>
但是，有些约定就像金科玉律一样，影响着我。比如：
</p>

<p>
一、结婚
</p>

<p>
我能不结婚吗？能。我会这样做（不结婚）吗？不会。我想这样做（不结婚）吗？不想。
</p>

<p>
二、生子
</p>

<p>
我能不生子吗？能。我会这样做（不生子）吗？不会。我想这样做（不生子）吗？不想。
</p>

<p>
为什么这样回答？
</p>

<p>
原因有很多层面。有个人层面，有社会约定层面。现在只谈后者：
</p>

<p>
社会长久以来的约定-&#x2013;&#x2014;结婚生子是必然发生的。社会要求我们这样做，为什么？因为社会要延续下去，不生子怎么能行？只要是两个人类就能生子吗？不是。两个人在生子前要缔结社会关系-&#x2013;&#x2014;婚姻。这种关系被社会承认，由法律约束。法律是社会约定的一层保障。
</p>
</div>
</body>
</html>